<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Editar Refactorizaciones</TITLE>
<link href="../../book.css" rel="stylesheet" type="text/css" />
</HEAD>
<body>

<H1><img align="middle" border="0" src="../images/4.png">Editar clasificaciones</H1>

<P> Para editar una clasificaci&oacute;n existente en primer lugar hay que indicar que la clasificaci&oacute;n debe ser de usuario tal y como se indic&oacute; en la secci&oacute;n del editor de clasificaciones.
<P>Una vez seleccionada una clasificaci&oacute;n de usuario su edici&oacute;n consiste en modificar sus atributos de forma similar a como se indicaba en la secci&oacute;n de creaci&oacute;n de una nueva clasificaci&oacute;n:
<blockquote>
  <p>En la secci&oacute;n <strong>Selected  	Classification</strong>, se puede <em>e</em>specificar  	la descripci&oacute;n para la clasificaci&oacute;n y determinar si se trata o no  	de una clasificaci&oacute;n multicategor&iacute;a. La <strong>descripci&oacute;n</strong> es simplemente un atributo descriptivo. El hecho de que la clasificaci&oacute;n sea <strong>multicategor&iacute;a</strong> indica que se permite que una refactorizaci&oacute;n pertenezca a m&aacute;s de una de las categor&iacute;as de la clasificaci&oacute;n, en caso de que este atributo no est&eacute; marcado cada refactorizaci&oacute;n s&oacute;lo podr&aacute; pertenecer a un m&aacute;ximo de una categor&iacute;a para esta clasificaci&oacute;n.</p>
</blockquote>
<p>&nbsp; </p>
<OL>
  <blockquote>
    <p align="center"><img src="../images/clasifEditor/selected-clasif-section.png" alt="" border="0"></p>
    <p align="center"><a name="_Toc176096201"><font size="1"><b>Secci&oacute;n de clasificaci&oacute;n seleccionada</b></font></a></p>
    <p>&nbsp;</p>
  </blockquote>
</OL>
<blockquote>
  <p>En la secci&oacute;n <strong>Categories</strong>,  	se pueden a&ntilde;adir categor&iacute;as a las que componen la  	clasificaci&oacute;n pulsando el bot&oacute;n de a&ntilde;adir. Tambi&eacute;n se pueden eliminar categor&iacute;as existentes o renombrar categor&iacute;as.</p>
  <p>La <strong>eliminaci&oacute;n</strong> de una categor&iacute;a supone eliminarla de la clasificaci&oacute;n y a su vez hace que todas las refactorizaciones que pertenecen a la categor&iacute;a dejen de hacerlo. Es necesario advertir de que en caso de que se quisiera recuperar la categor&iacute;a eliminada cre&aacute;ndola de nuevo, no se restaurar&iacute;an las refactorizaciones que anteriormente pertenec&iacute;an a ella.</p>
  <p align="center"><img src="../images/clasifEditor/categories-section.png" alt="" border="0"></p>
  <p align="center"><a name="_Toc176096201"><font size="1"><b>Secci&oacute;n de categor&iacute;as de la clasificaci&oacute;n</b></font></a></p>
  <p>Adem&aacute;s en la secci&oacute;n <strong>Classifications</strong>, se puede	renombrar la clasificaci&oacute;n seleccionada pulsando sobre el bot&oacute;n de renombrar.</p>
<p align="center"><img src="../images/clasifEditor/classifications-section.png" alt="" border="0"></p>
  <p align="center"><a name="_Toc176096201"><font size="1"><b>Secci&oacute;n de categor&iacute;as de la clasificaci&oacute;n</b></font></a></p>
  <p align="center">&nbsp;</p>
</blockquote>
<P><br>

<p><img src="../images/1.png"  alt="Related tasks"></p>
<ul class="NavList">
  <li><a href="creation.html">Crear nuevas clasificaciones</a></li>
  <li><a href="deletion.html">Eliminar una clasificaci&oacute;n</a></li>
  <li><br></li>
</ul>
<p>
<br>
</body>
</html>
