<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Crear Refactorizaciones</TITLE>
<link href="../../book.css" rel="stylesheet" type="text/css" />
</HEAD>

<body>
<H1><img align="middle" border="0" src="../images/4.png">Panel de clasificaciones</H1>
<P>
<p>
  <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
  <HTML>
  <!--  		@page { margin: 2cm }  		P { text-indent: 1.2cm; margin-top: 0.42cm; margin-bottom: 0.21cm; background: transparent; line-height: 150%; text-align: justify }  		P.western { font-family: "Verdana", sans-serif; font-size: 10pt }  	-->
  <BODY DIR="LTR">
</p>
<p ALIGN="LEFT">
  <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
  <HTML>
  <!--  		@page { margin: 2cm }  		P { text-indent: 1.2cm; margin-top: 0.42cm; margin-bottom: 0.21cm; background: transparent; line-height: 150%; text-align: justify }  		P.western { font-family: "Verdana", sans-serif; font-size: 10pt }  	-->
  <BODY DIR="LTR">
</p>
<p> El <strong>Classification  Panel</strong> se sit&uacute;a en la zona izquierda de la  vista y esta destinado a la visualizaci&oacute;n del cat&aacute;logo de  refactorizaciones. En &eacute;l se da la posibilidad de visualizar las  refactorizaciones clasificadas seg&uacute;n las categor&iacute;as de la  clasificaci&oacute;n que previamente se haya seleccionado. Adem&aacute;s se  podr&aacute;n aplicar filtros al cat&aacute;logo de refactorizaciones con el  objetivo de mostrar exclusivamente aquellas refactorizaciones que  cumplan con ciertos criterios que se establezcan.</p>
<p> En  la siguiente ilustraci&oacute;n se puede apreciar el panel:</p>
<blockquote>
  <p align="center">&nbsp;</p>
  <br>
    
  <p align="center"><img src="../images/catalog/clasif-panel.png" width="339" height="311" border="0"></p>
  <p align="center"><a name="_Toc176096201"><font size="1"><b>Panel de clasificaciones</b></font></a></p>
  <p>&nbsp;</p>
</blockquote>
<p>En la parte superior consta de un combo en el que se puede seleccionar la clasificaci&oacute;n por la que se organizar&aacute;n las categor&iacute;as. Inmediatamente debajo de ese combo se encuentran la descripci&oacute;n de la clasificaci&oacute;n seleccionada y el <strong>&aacute;rbol con todas las refactorizaciones</strong> organizadas seg&uacute;n las categor&iacute;as de la clasificaci&oacute;n y seg&uacute;n los filtros aplicados.</p>
<p>Debajo del &aacute;rbol aparecen la <strong>lista de filtros aplicados</strong> con la opci&oacute;n de desactivar y eliminar por cada uno de ellos y encima de esta lista un checkbox que permite ocultar o mostrar las refactorizaciones filtradas.</p>
<p>En la esquina superior se muestra el campo de filtrado y el bot&oacute;n para aplicar un filtro. Para m&aacute;s informaci&oacute;n sobre los filtros estos son explicados en la secci&oacute;n de B&uacute;squedas con filtros.<br>
</p>
<p><img src="../images/1.png"  alt="Related tasks"></p>

<ul class="NavList">
  <LI>
  <p><a href="toolbar.html">Barra de herramientas</a></p>
  <LI>
  <p><a href="summary.html">Panel de resumen </a></p>  
  <LI><a href="filtrado.html">B&uacute;squedas con filtros
  </a>
  <li><br>
	  <br>
	</li>
</ul>
<p>
<br>
</body>
</html>
