<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Crear Refactorizaciones</TITLE>
<link href="../../book.css" rel="stylesheet" type="text/css" />
</HEAD>

<body>
<H1><img align="middle" border="0" src="../images/4.png">Cat&aacute;logo de refactorizaciones</H1>
<P>
<p>
  <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
  <HTML>
  <!--  		@page { margin: 2cm }  		P { text-indent: 1.2cm; margin-top: 0.42cm; margin-bottom: 0.21cm; background: transparent; line-height: 150%; text-align: justify }  		P.western { font-family: "Verdana", sans-serif; font-size: 10pt }  	-->
  <BODY DIR="LTR">
</p>
<p ALIGN="LEFT"> La  vista <em>Refactoring  Catalog Browser </em>dispone  de una barra de herramientas que incluye las distintas acciones que  se pueden llevar a cabo sobre esta. En este caso, nos encontramos con  cinco botones que han sido distribuidos en dos grupos; el de la  izquierda contiene dos botones independientes mientras que el de la  derecha contiene tres botones con funcionalidad relacionada, estos  &uacute;ltimos estar&aacute;n siempre todos disponibles salvo uno de ellos que se  encontrar&aacute; deshabilitado. </p>
<p> En  la siguiente ilustraci&oacute;n se puede apreciar la barra de herramientas  de la vista y acto seguido se detallar&aacute; de forma ordenada la funcionalidad de cada uno  de los botones que contiene.</p>
<p>

<p align="center"><img src="../images/catalog/catalog-toolbar.png" alt="" width="532" height="27" border="0"></p>
<p align="center"><a name="_Toc176096201"><font size="1"><b>Vista del cat&aacute;logo</b></font></a></p>
<p ALIGN="CENTER"><BR>
</p>
</p>
<UL>
  <LI>
    <p ALIGN="LEFT"> Refrescar  	vista </p>
    <p> Permite  	refrescar la vista con la finalidad de visualizar actualizado el  	cat&aacute;logo de refactorizaciones. Esta funcionalidad es importante ya  	que la modificaci&oacute;n de refactorizaciones puede realizarse por  	varias v&iacute;as, por ejemplo por un cambio en su propia definici&oacute;n  	pero tambi&eacute;n podr&iacute;a ser por un cambio en una categor&iacute;a a la que  	esta pertenece. Es por ello que es importante que el usuario tenga  	presente que cuando realice alg&uacute;n cambio que afecte a estas deber&aacute;  	utilizar esta funcionalidad para que la informaci&oacute;n que la vista  	muestre se encuentre actualizada.</p>
    <p> </p>
  <LI>
    <p ALIGN="LEFT"> Editor  	de clasificaciones</p>
  <p> Permite  	abrir el editor de clasificaciones con el fin de visualizar la  	informaci&oacute;n asociada a las clasificaciones disponibles o realizar  	la edici&oacute;n de las mismas. Cuando este bot&oacute;n es pulsado se abrir&aacute;  	el editor de clasificaciones en la zona que Eclipse  	dispone para la visualizaci&oacute;n de editores. En caso de que este ya  	estuviese abierto se activar&aacute; la pesta&ntilde;a correspondiente al  	editor, situ&aacute;ndonos en &eacute;l.</p>
</UL>
<p>&nbsp;  </p>
<UL>
  <LI>
    <p ALIGN="LEFT">Mostrar  	panel izquierdo</p>
  <p ALIGN="JUSTIFY">Permite  	mostrar &uacute;nicamente el panel izquierdo <em>Classification  	Panel</em>,  	destinado a la clasificaci&oacute;n de refactorizaciones, disponiendo de  	todo el tama&ntilde;o de la vista para su visualizaci&oacute;n. Adem&aacute;s cuando  	este bot&oacute;n es pulsado se deshabilita y quedan habilitados los otros  	dos; <em>Show  	right pane</em> y <em>Show  	all panes</em>.</p>
  </UL>
<p>&nbsp;  </p>
<UL>
  <LI>
    <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
    Mostrar  	panel derecho
  <p ALIGN="JUSTIFY">Permite  	mostrar &uacute;nicamente el panel derecho <em>Summary  	Panel</em>,  	destinado a la visualizaci&oacute;n de la informaci&oacute;n asociada a una  	refactorizaci&oacute;n, disponiendo de todo el tama&ntilde;o de la vista para su  	visualizaci&oacute;n. Adem&aacute;s cuando este bot&oacute;n es pulsado se deshabilita  	y quedan habilitados los otros dos; <em>Show  	left pane</em> y <em>Show  	all panes</em>.</p>  
</UL>
<p>&nbsp;  
</p>
<UL>
  <LI>
    <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
    <p ALIGN="LEFT">Mostrar  	todos los paneles</p>
    <p ALIGN="JUSTIFY">Permite  	mostrar tanto el panel izquierdo <em>Classification  	Panel</em>,  	destinado a la clasificaci&oacute;n de refactorizaciones, como el panel  	derecho <em>Summary  	Panel</em></p>
</UL>
<blockquote>
  <p align="center"><br>
</p>
</blockquote>
<p><img src="../images/1.png"  alt="Related tasks"></p>
<ul class="NavList">
<LI>
  <p><a href="clasifPanel.html">Panel de clasificaci&oacute;n</a></p>
<LI>
  <p><a href="summary.html">Panel de resumen</a></p>  
  <LI>B&uacute;squedas con filtros
  <li><br>
	  <br>
	</li>
</ul>
<p>
<br>
</body>
</html>
